// =========================================== PRACTICE FROM CODE.ME ===============================
// --------------------------------------------------------------------------------------------------
// Сделайте калькулятор, который будет находить площадь и периметр квадрата
// const square = a => a * a;
// const perimeter = a => a * 4;

// console.log(square(5));
// console.log(perimeter(5));
// ------------------------------------------------------------------------------------------------
// Сделайте калькулятор, который будет находить площадь и периметр прямоугольника.
// const square = (a, b) => a * b;
// const perimeter = (a, b) => 2 * (a + b);

// console.log(square(5, 7));
// console.log(perimeter(5, 7));
// -----------------------------------------------------------------------------------------------------
// Сделайте калькулятор, который будет находить площадь круга и длину окружности.
// const square = (r, pi = 3.1415) => r * r * pi;
// const perimeter = (r, pi = 3.1415) => 2 * r * pi;

// console.log(square(5));
// console.log(perimeter(5));
// -----------------------------------------------------------------------------------------------------
// Сделайте калькулятор, который будет находить площадь треугольника по трем сторонам.
// const square = (a, b, c) =>
//   (((a + b + c) / 2) *
//     ((a + b + c) / 2 - a) *
//     ((a + b + c) / 2 - b) *
//     ((a + b + c) / 2 - c)) **
//   0.5;
// console.log(square(5, 7, 10));
// -----------------------------------------------------------------------------------------------------
